mikeferguson/stm32/projects/tablebot/main.cpp
/*
 * Copyright (c) 2012-2024, Michael E. Ferguson
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 *  * Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *  * Redistributions in binary form must reproduce the above
 *    copyright notice, this list of conditions and the following
 *    disclaimer in the documentation and/or other materials provided
 *    with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include "tablebot.hpp"
#include "dynamixel.hpp"
#include "pid.hpp"
#include "arm_math.h"

#include "netconf.h"
#include "lwip/memp.h"
#include "lwip/udp.h"
#include "stm32f4x7_eth.h"

#include "mini_imu9.hpp"
#include "md01.hpp"
#include "motor_trace.hpp"
#include "encoder.hpp"
#include "usart_dma.hpp"
#include "analog_sampler.hpp"
#include "ld06.hpp"

MiniImu9<I2C1_BASE,
         DMA1_Stream0_BASE, 0 /* stream */, 1 /* channel */,
         imu_scl, imu_sda> imu;
Md01<TIM1_BASE, m1_a, m1_b, m1_en> m1;
Md01<TIM8_BASE, m2_a, m2_b, m2_en> m2;
Encoder<TIM4_BASE> m1_enc;
Encoder<TIM3_BASE> m2_enc;
MotorTrace<1000> m1_trace;
MotorTrace<1000> m2_trace;
usart1_t usart1;
usart2_t usart2;
DynamixelParser<usart1_t> usart1_parser;
DynamixelParser<usart2_t> usart2_parser;

system_state_t system_state;
registers_t registers;
uint32_t last_packet;  // Timestamp of last packet
uint32_t last_motor_cmd;  // Timestamp of last motor command

#include "user_io.hpp"

// Setup the baud rate of dynamixel ports
int set_dynamixel_baud(uint8_t value)
{
  uint32_t baud = 0;
  if (value == 1)
    baud = 1000000;
  else if (value == 3)
    baud = 500000;
  else if (value == 34)
    baud = 57600;
  else if (value == 250)
    baud = 2250000;
  else if (value == 251)
    baud = 2500000;
  else if (value == 252)
    baud = 3000000;
  else
    return -1;  // Unsupported baud rate

  usart1.init(baud, 8);
  usart2.init(baud, 8);
  registers.baud_rate = value;
  return 1;
}

struct udp_pcb *eth_udp = NULL;  // The actual UDP port
struct ip_addr return_ipaddr;  // The IP to return stuff to
uint16_t return_port;  // Port to return stuff to
uint16_t usart3_port;  // Port to return usart3 packets to (if usart3_char != 255)
uint8_t usart3_string[256];
uint8_t usart3_len;

#define NECK_SERVO_ID     13
#include "ax12.hpp"
#include "select.hpp"
bool tablebot_mode;

#include "assembler.hpp"
LaserAssembler assembler;

#define TABLEBOT_PACKET_STATUS               0xff
#define TABLEBOT_PACKET_LASER_SCAN           0
#define TABLEBOT_PACKET_PROJECTED_POINTS     1
#define TABLEBOT_PACKET_SEGMENT_POINTS       2

// From IAP app note
typedef  void (*pFunction)(void);

void udp_send_packet(uint8_t * packet, uint32_t len, uint16_t port, uint8_t type = TABLEBOT_PACKET_STATUS)
{
  struct pbuf * p_send = pbuf_alloc(PBUF_TRANSPORT, len + 5, PBUF_RAM);
  unsigned char * x = (unsigned char *) p_send->payload;

  // ethernet header
  *x++ = type; *x++ = 'B'; *x++ = 'O'; *x++ = 'T';

  // copy payload
  for(int i = 0; i < len; ++i)
  {
    *x++ = packet[i];
  }

  // send it
  udp_sendto(eth_udp, p_send, &return_ipaddr, port);
  pbuf_free(p_send);
}

void udp_callback(void *arg, struct udp_pcb *udp, struct pbuf *p,
                  struct ip_addr *addr, uint16_t port)
{
  uint8_t * data = (uint8_t*) p->payload;

  // Toss any bad packets
  if ( (p->len < 4) ||
       (p->len != p->tot_len) ||
       (data[0] != 0xff) || (data[1] != 'B') || (data[2] != 'O') || (data[3] != 'T'))
  {
    ++registers.packets_bad;
    pbuf_free(p);
    return;
  }

  // Update return data
  return_ipaddr = *addr;
  return_port = port;
  last_packet = system_state.time;

  if (p->len == 8 &&
      data[4] == 'B' &&
      data[5] == 'O' &&
      data[6] == 'O' &&
      data[7] == 'T')
  {
    // Disable interrupts before jumping
    __disable_irq();

    // Disable motor driver
    m1_pwm::mode(GPIO_INPUT);
    m2_pwm::mode(GPIO_INPUT);
    m1_en::mode(GPIO_INPUT);
    m2_en::mode(GPIO_INPUT);

    // Turn off LED
    act::low();

    // Jump into bootloader
    force_bootloader::mode(GPIO_OUTPUT);
    force_bootloader::low();
    uint32_t JumpAddress = *(__IO uint32_t*) (0x08000000 + 4);
    pFunction Jump_To_Application = (pFunction) JumpAddress;
    __set_MSP(*(__IO uint32_t*)0x08000000);
    Jump_To_Application();
  }

  if (tablebot_mode)
  {
    // Send packet with just the table, no laser data
    udp_send_packet((unsigned char *) &system_state, sizeof(system_state), return_port);
    pbuf_free(p);
    return;
  }

  // Traditional Etherbotix Mode

  // For each packet
  size_t i = 4;
  while (i < p->len)
  {
    if ((data[i] != 0xff) || (data[i + 1] != 0xff))
    {
      // Packet has become corrupted?
      ++registers.packets_bad;
      pbuf_free(p);
      return;
    }

    uint8_t id = data[i + 2];
    uint8_t len = data[i + 3];
    uint8_t instruction = data[i + 4];

    if (id == ETHERBOTIX_ID)
    {
      // Process packets for self
      if (instruction == DYN_READ_DATA)
      {
        uint8_t read_addr = data[i + 5];
        uint8_t read_len = data[i + 6];

        // Update anything that isn't periodically updated
        user_io_update();

        uint8_t packet[256];
        packet[0] = 0xff;
        packet[1] = 0xff;
        packet[2] = ETHERBOTIX_ID;
        packet[3] = read_len + 2;
        packet[4] = read_addr;  // we transmit address instead of error
        packet[5 + read_len] = ETHERBOTIX_ID + read_len + 2 + read_addr;  // Init checksum

        if (read_addr >= 128)
        {
          if (read_addr == DEVICE_UNIQUE_ID)
          {
            // Read the unique ID of the chip (See RM0090 39.1)
            uint8_t * id_data = (uint8_t *) 0x1fff7a10;
            for (int j = 0; j < read_len; ++j)
            {
              packet[5 + j] = *(id_data++);
              packet[5 + read_len] += packet[5+j];
            }
          }
          else if (read_addr == DEVICE_M1_TRACE)
          {
            read_len = m1_trace.get(&packet[5], read_len);
            // Set checksum
            packet[3] = read_len + 2;
            packet[5 + read_len] = ETHERBOTIX_ID + read_len + 2 + read_addr;
            for (size_t j = 0; j < read_len; ++j)
            {
              packet[5 + read_len] += packet[5 + j];
            }
          }
          else if (read_addr == DEVICE_M2_TRACE)
          {
            read_len = m2_trace.get(&packet[5], read_len);
            // Set checksum
            packet[3] = read_len + 2;
            packet[5 + read_len] = ETHERBOTIX_ID + read_len + 2 + read_addr;
            for (size_t j = 0; j < read_len; ++j)
            {
              packet[5 + read_len] += packet[5 + j];
            }
          }
        }
        else
        {
          // Disable interrupts so we don't slice things like encoder values
          __disable_irq();
          // Copy packet data
          uint8_t * reg_data = (uint8_t *) &registers;
          reg_data += read_addr;
          for (int j = 0; j < read_len; ++j)
          {
            packet[5 + j] = *(reg_data++);
            packet[5 + read_len] += packet[5 + j];
          }
          __enable_irq();
        }

        packet[5 + read_len] = 255 - packet[5 + read_len];  // Compute checksum
        udp_send_packet(packet, read_len + 6, port);
      }
      else if (instruction == DYN_WRITE_DATA)
      {
        uint8_t write_addr = data[i + 5];
        if (write_addr >= 128)
        {
          // This is a device, write all data to single place
          if (write_addr == DEVICE_USART3_DATA)
          {
            user_io_usart3_write(&data[i + 6], len - 3);
          }
          else if (write_addr == DEVICE_SPI2_DATA)
          {
            // TODO
          }
          else if (write_addr == DEVICE_BOOTLOADER)
          {
            if (len == 7 &&
                data[i + 6] == 'B' &&
                data[i + 7] == 'O' &&
                data[i + 8] == 'O' &&
                data[i + 9] == 'T')
            {
              // Disable interrupts before jumping
              __disable_irq();

