mikeferguson/stm32/projects/tablebot/main.cpp
              // Disable motor driver
              m1_pwm::mode(GPIO_INPUT);
              m2_pwm::mode(GPIO_INPUT);
              m1_en::mode(GPIO_INPUT);
              m2_en::mode(GPIO_INPUT);

              // Set all IO low/input
              user_io_deinit();

              // Jump into bootloader
              force_bootloader::mode(GPIO_OUTPUT);
              force_bootloader::low();
              uint32_t JumpAddress = *(__IO uint32_t*) (0x08000000 + 4);
              pFunction Jump_To_Application = (pFunction) JumpAddress;
              __set_MSP(*(__IO uint32_t*)0x08000000);
              Jump_To_Application();
            }
          }
          else if (write_addr == DEVICE_M1_TRACE)
          {
            m1_trace.stop_tracing();
          }
          else if (write_addr == DEVICE_M2_TRACE)
          {
            m2_trace.stop_tracing();
          }
        }
        else
        {
          int j = 0;
          bool update_gains = false;
          while (j < len - 3)
          {
            if (write_addr + j == REG_BAUD_RATE)
            {
              // Update baud rate
              uint8_t baud = data[i + 6 + j];
              set_dynamixel_baud(baud);
            }
            else if (write_addr + j == REG_DELAY_TIME)
            {
              // TODO
            }
            else if (write_addr + j == REG_DIGITAL_DIR)
            {
              registers.digital_dir = data[i + 6 + j];
              user_io_set_direction();
            }
            else if (write_addr + j == REG_DIGITAL_OUT)
            {
              registers.digital_out = data[i + 6 + j];
              user_io_set_output();
            }
            else if (write_addr + j == REG_LED)
            {
              registers.led = data[i + 6 + j];
              if (data[i + 6 + j] > 0)
                error::high();
              else
                error::low();
            }
            else if (write_addr + j == REG_MOTOR_PERIOD)
            {
              if (data[i + 6 + j ] > 0 && data[i + 6 + j] < 100)
                registers.motor_period = data[i + 6 + j];
            }
            else if (write_addr + j == REG_MOTOR_MAX_STEP)
            {
              registers.motor_max_step = data[i + 6 + j] + (data[i + 7 + j] << 8);
              __disable_irq();
              m1_pid.set_max_step(registers.motor_max_step);
              m2_pid.set_max_step(registers.motor_max_step);
              __enable_irq();
              ++j;  // uses 2 bytes
            }
            else if (write_addr + j == REG_MOTOR1_VEL)
            {
              // Write 16-bit setpoint
              int16_t v = data[i + 6 + j] + (data[i + 7 + j] << 8);
              __disable_irq();
              m1_pid.update_setpoint(v);
              __enable_irq();
              last_motor_cmd = registers.system_time;
              ++j;  // uses 2 bytes
            }
            else if (write_addr + j == REG_MOTOR2_VEL)
            {
              // Write 16-bit setpoint
              int16_t v = data[i + 6 + j] + (data[i + 7 + j] << 8);
              __disable_irq();
              m2_pid.update_setpoint(v);
              __enable_irq();
              last_motor_cmd = registers.system_time;
              ++j;  // uses 2 bytes
            }
            else if (write_addr + j >= REG_MOTOR1_KP &&
                     write_addr + j < REG_ACC_X)
            {
              // Updating gains
              uint8_t * reg_data = (uint8_t *) &registers;
              reg_data[write_addr + j] = data[i + 6 + j];
              update_gains = true;
            }
            else if (write_addr + j == REG_USART3_BAUD)
            {
              // Set baud, start usart
              registers.usart3_baud = data[i + 6 + j];
              user_io_usart3_init();
              usart3_port = port;
            }
            else if (write_addr + j == REG_USART3_CHAR)
            {
              // Set terminating character & return port, reset length of string
              registers.usart3_char = data[i + 6 + j];
              usart3_len = 0;
              usart3_port = port;
            }
            else if (write_addr + j == REG_TIM12_MODE)
            {
              registers.tim12_mode = data[i + 6 + j];
              user_io_tim12_init();
            }
            else if (write_addr + j == REG_SPI2_BAUD)
            {
              // TODO Set baud rate of SPI2
            }
            else
            {
              // INSTRUCTION ERROR on invalid write?
            }
            ++j;
          }
          if (update_gains)
          {
            // Stop motors
            m1_pid.reset();
            m2_pid.reset();

            // Actually update gains
            m1_pid.set_gains(registers.motor1_kp, registers.motor1_kd,
                             registers.motor1_ki, registers.motor1_windup);
            m2_pid.set_gains(registers.motor2_kp, registers.motor2_kd,
                             registers.motor2_ki, registers.motor2_windup);
          }
        }
      }
    }
    else  // Pass through to servos
    {
      // Make sure any previous packets are done sending
      while (!(usart1.done() && usart2.done()))
        ;

      // Reset parsers
      usart1_parser.reset(&usart1);
      usart2_parser.reset(&usart2);

      if (instruction == DYN_READ_DATA)
      {
        // Blast packet to each bus
        usart1.write(&data[i], len + 4);
        usart2.write(&data[i], len + 4);

        // Wait for send to complete
        while (!(usart1.done() && usart2.done()))
          ;

        // Wait for response on at least one bus
        while (true)
        {
          int8_t p1 = usart1_parser.parse(&usart1, registers.system_time);
          if (p1 > 0)
          {
            // Got a packet
            uint8_t packet[256];
            packet[0] = 0xff;
            packet[1] = 0xff;
            packet[2] = usart1_parser.packet.id;
            packet[3] = usart1_parser.packet.length;
            packet[4] = usart1_parser.packet.instr_status;
            for (int j = 0; j < usart1_parser.packet.length-2; ++j)
              packet[5+j] = usart1_parser.packet.parameters[j];
            packet[3+usart1_parser.packet.length] = usart1_parser.packet.checksum;
            udp_send_packet(packet, usart1_parser.packet.length + 4, port);
            break;
          }

          int8_t p2 = usart2_parser.parse(&usart2, registers.system_time);
          if (p2 > 0)
          {
            // Got a packet
            uint8_t packet[256];
            packet[0] = 0xff;
            packet[1] = 0xff;
            packet[2] = usart2_parser.packet.id;
            packet[3] = usart2_parser.packet.length;
            packet[4] = usart2_parser.packet.instr_status;
            for (int j = 0; j < usart2_parser.packet.length-2; ++j)
              packet[5+j] = usart2_parser.packet.parameters[j];
            packet[3+usart2_parser.packet.length] = usart2_parser.packet.checksum;
            udp_send_packet(packet, usart2_parser.packet.length + 4, port);
            break;
          }

          if (p1 < 0 && p2 < 0)
          {
            // Timeout or other error
            break;
          }
        }
      }
      else if (instruction == DYN_SYNC_READ)
      {
        // What to read
        uint8_t read_addr = data[i+5];  // First parameter is the read address
        uint8_t read_len = data[i+6];   // Second parameter is # of bytes to read

        // Single response packet to send back to PC from several servo packets
        uint8_t packet[256];
        packet[0] = 0xff;
        packet[1] = 0xff;
        packet[2] = 0xfe;  // broadcast
        packet[3] = 2 + (read_len*(len-4));
        packet[4] = read_addr;  // we transmit address instead of error
        uint8_t packet_idx = 5;
        uint8_t packet_chk = packet[2] + packet[3] + packet[4];

        // Read data from each servo
        for (int j = 2; j < len-2; ++j)
        {
          uint8_t pkt[256];
          pkt[0] = 0xff;
          pkt[1] = 0xff;
          pkt[2] = data[i+5+j];  // ID of this servo
          pkt[3] = 4;  // len remaining
          pkt[4] = DYN_READ_DATA;
          pkt[5] = read_addr;
          pkt[6] = read_len;
          uint8_t chk = 0;
          for (int p = 2; p < 7;p++)
            chk += pkt[p];
          pkt[7] = 255 - chk;

          // Reset parsers
          usart1_parser.reset(&usart1);
          usart2_parser.reset(&usart2);

          // Send read to each bus
          usart1.write(pkt, 8);
          usart2.write(pkt, 8);

          // Wait for send to complete
          while (!(usart1.done() && usart2.done()))
            ;

          // Wait for response on at least one bus
          while (true)
          {
            int8_t p1 = usart1_parser.parse(&usart1, registers.system_time);
            if (p1 > 0)
            {
              // Got a packet
              for (uint8_t k = 0; k < read_len; ++k)
              {
                packet[packet_idx++] = usart1_parser.packet.parameters[k];
                packet_chk += usart1_parser.packet.parameters[k];
              }
              break;
            }

            int8_t p2 = usart2_parser.parse(&usart2, registers.system_time);
            if (p2 > 0)
            {
              // Got a packet
              for (uint8_t k = 0; k < read_len; ++k)
              {
                packet[packet_idx++] = usart2_parser.packet.parameters[k];
                packet_chk += usart2_parser.packet.parameters[k];
              }
              break;
            }

            if (p1 < 0 && p2 < 0)
            {
              // Timeout or other error
              for (uint8_t k = 0; k < read_len; ++k)
              {
                packet[packet_idx++] = 0xff;  // 0xffff is not a valid servo position
                packet_chk += 0xff;
              }
              break;
            }
          }  // end while wait for packet
        }  // end for each servo

        packet[packet_idx++] = 255-packet_chk;
        udp_send_packet(packet, packet_idx, port);
      }
      else if (instruction == DYN_WRITE_DATA ||
               instruction == DYN_SYNC_WRITE)
      {
        // Blast packet to each bus
        usart1.write(&data[i], len + 4);
        usart2.write(&data[i], len + 4);

        // Wait for send to complete
        while (!(usart1.done() && usart2.done()))
          ;

