mikeferguson/stm32/projects/tablebot/main.cpp
        // No need to wait for response
      }
    }

    i += len + 4;
  }

  // Free buffer
  pbuf_free(p);
  ++registers.packets_recv;
}

// Located here so we can send packets from behaviors
#include "behaviors.hpp"

int udp_interface_init()
{
  eth_udp = udp_new();
  if (eth_udp == NULL)
    return 0;

  if (udp_bind(eth_udp, IP_ADDR_ANY, 6707) != ERR_OK)
    return 0;

  udp_recv(eth_udp, udp_callback, NULL);
  return 1;
}

int main(void)
{
  // TODO save/load register table from flash

  // Setup register table data
  registers.model_number = 301;  // Arbotix was 300
  registers.version = 7;
  registers.id = 253;
  registers.baud_rate = 1;  // 1mbps
  registers.digital_dir = 0;  // all in
  registers.digital_out = 0;
  registers.system_time = last_packet = last_motor_cmd = 0;
  registers.motor_period = 10;  // 10mS period = 100hz
  registers.motor_max_step = 10;
  registers.motor1_kp = registers.motor2_kp = 1.0;
  registers.motor1_kd = registers.motor2_kd = 0;
  registers.motor1_ki = registers.motor2_ki = 0.1;
  registers.motor1_windup = registers.motor2_windup = 400;
  registers.usart3_baud = 34;  // 56700
  registers.usart3_char = 255;  // No terminating character
  registers.packets_recv = registers.packets_bad = 0;

  m1_pid.set_max_step(registers.motor_max_step);
  m1_pid.set_gains(registers.motor1_kp, registers.motor1_kd,
                   registers.motor1_ki, registers.motor1_windup);
  m2_pid.set_max_step(registers.motor_max_step);
  m2_pid.set_gains(registers.motor2_kp, registers.motor2_kd,
                   registers.motor2_ki, registers.motor2_windup);

  // Setup system state for tablebot
  tablebot_mode = false;  // Not enabled by default
  system_state.time = 0;
  system_state.run_state = MODE_UNSELECTED;
  system_state.neck_angle = 0;
  system_state.pose_x = 0.15f;
  system_state.pose_y = 0.0f;
  system_state.pose_th = 0.0f;
  system_state.last_motor_command = 0;
  system_state.version = 100;

  NVIC_SetPriorityGrouping(3);

  // Enable GPIO
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;

  act::mode(GPIO_OUTPUT);
  error::mode(GPIO_OUTPUT);
  error::high();  // Hold error high during setup

  // Check state of start button - if held - enable tablebot mode
  d7::mode(GPIO_INPUT);
  d7::high();
  d7::pullup();
  if (d7::value() == 0)
  {
    tablebot_mode = true;

    // Setup drive motors
    m1_pid.set_max_step(10);
    m1_pid.set_gains(4.0, 0.0, 0.15, 400.0);
    m2_pid.set_max_step(10);
    m2_pid.set_gains(4.0, 0.0, 0.15, 400.0);

    registers.motor_period = MOTOR_PERIOD;
  }

  // Setup ethernet
  setup_gpio_ethernet();

  // Setup serial
  RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN | RCC_AHB1ENR_DMA2EN;
  RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
  usart1_tx::mode(GPIO_ALTERNATE | GPIO_AF_USART1);
  usart1_rx::mode(GPIO_ALTERNATE | GPIO_AF_USART1);
  NVIC_SetPriority(USART1_IRQn, 1);
  NVIC_EnableIRQ(USART1_IRQn);
  RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
  usart2_tx::mode(GPIO_ALTERNATE | GPIO_AF_USART2);
  usart2_rx::mode(GPIO_ALTERNATE | GPIO_AF_USART2);
  NVIC_SetPriority(USART2_IRQn, 1);
  NVIC_EnableIRQ(USART2_IRQn);
  set_dynamixel_baud(registers.baud_rate);

  // Setup motors
  RCC->APB2ENR |= RCC_APB2ENR_TIM1EN | RCC_APB2ENR_TIM8EN;
  m1_pwm::mode(GPIO_ALTERNATE | GPIO_AF_TIM1);
  m2_pwm::mode(GPIO_ALTERNATE | GPIO_AF_TIM8);
  m1.init(17, 1024);  // actually 16.7kHz, 10-bit resolution
  m2.init(17, 1024);

  // Setup encoders
  RCC->APB1ENR |= RCC_APB1ENR_TIM3EN | RCC_APB1ENR_TIM4EN;
  m1_enc_a::mode(GPIO_ALTERNATE | GPIO_AF_TIM4);
  m1_enc_b::mode(GPIO_ALTERNATE | GPIO_AF_TIM4);
  m2_enc_a::mode(GPIO_ALTERNATE | GPIO_AF_TIM3);
  m2_enc_b::mode(GPIO_ALTERNATE | GPIO_AF_TIM3);
  m1_enc.init();
  m2_enc.init();

  // Setup IMU
  imu.init(100000);
  imu.use_magnetometer(true);

  // Setup analog
  RCC->APB2ENR |= RCC_APB2ENR_ADC1EN | RCC_APB2ENR_ADC2EN | RCC_APB2ENR_ADC3EN;
  adc1.init(VOLTAGE_ANALOG_CHANNEL,
            SERVO_CURRENT_ANALOG_CHANNEL,
            AUX_CURRENT_ANALOG_CHANNEL,
            A0_ANALOG_CHANNEL);
  adc2.init(M1_CURRENT_ANALOG_CHANNEL,
            M2_CURRENT_ANALOG_CHANNEL,
            A1_ANALOG_CHANNEL,
            A2_ANALOG_CHANNEL);  // TODO: set trigger on motor timer
  voltage_sense::mode(GPIO_INPUT_ANALOG);
  servo_sense::mode(GPIO_INPUT_ANALOG);
  adc1.setSampleTime(SERVO_CURRENT_ANALOG_CHANNEL, ADC_SampleTime_84Cycles);
  aux_sense::mode(GPIO_INPUT_ANALOG);
  adc1.setSampleTime(AUX_CURRENT_ANALOG_CHANNEL, ADC_SampleTime_84Cycles);
  m1_sense::mode(GPIO_INPUT_ANALOG);
  m2_sense::mode(GPIO_INPUT_ANALOG);

  if (tablebot_mode)
  {
    // Initialize cliff sensor pins
    a0_sense::mode(GPIO_INPUT_ANALOG);
    a1_sense::mode(GPIO_INPUT_ANALOG);
    a2_sense::mode(GPIO_INPUT_ANALOG);

    // Laser interface
    user_io_ld06_init();

    // Unused IO
    d3::mode(GPIO_INPUT);
    // Temporarily used for timing debugging
    d6::mode(GPIO_OUTPUT);
  }

  // Setup systick
  SysTick_Config(SystemCoreClock/1000);

  LwIP_Init();
  if (!udp_interface_init())
    while(1);

  __enable_irq();
  error::low();  // Done with setup

  if (tablebot_mode) move_neck(512);

  bool disable_eth = false;
  while(1)
  {
    if (!disable_eth && (LwIP_Periodic_Handle(system_state.time) == ETH_ERROR))
    {
      if (tablebot_mode) disable_eth = true;
    }

    if (tablebot_mode)
    {
      if (imu.update(system_state.time))
      {
        system_state.accel_x = -imu.accel_data.x;
        system_state.accel_y = -imu.accel_data.z;
        system_state.accel_z = -imu.accel_data.y;

        system_state.gyro_x = -imu.gyro_data.x;
        system_state.gyro_y = -imu.gyro_data.z;
        system_state.gyro_z = -imu.gyro_data.y;

        system_state.mag_x = -imu.mag_data.x;
        system_state.mag_y = -imu.mag_data.z;
        system_state.mag_z = -imu.mag_data.y;
      }

      system_state.run_state = select_mode();

      // Attempt to read from laser data
      // From scope: this takes 2-8uS, and loop runs about 3.7khz (3/8/2023)
      d6::high();
      int8_t length = laser.update(&usart3, system_state.time);
      if (length > 0)
      {
        // Send debugging packets
        if (system_state.time - last_packet < 1000)
        {
          udp_send_packet((unsigned char *) &laser.packet, sizeof(laser.packet), return_port, TABLEBOT_PACKET_LASER_SCAN);
        }

        // Add to assembler
        assembler.add_packet(&laser.packet);
      }
      else if (length < 0)
      {
        laser.reset(&usart3);
      }
      d6::low();

