mikeferguson/stm32/projects/tablebot/main.cpp
      run_behavior(system_state.run_state, system_state.time);
      continue;
    }

    if (imu.update(registers.system_time))
    {
      registers.accel_x = imu.accel_data.x;
      registers.accel_y = imu.accel_data.y;
      registers.accel_z = imu.accel_data.z;

      registers.gyro_x = imu.gyro_data.x;
      registers.gyro_y = imu.gyro_data.y;
      registers.gyro_z = imu.gyro_data.z;

      registers.mag_x = imu.mag_data.x;
      registers.mag_y = imu.mag_data.y;
      registers.mag_z = imu.mag_data.z;
    }
    registers.imu_flags = imu.get_flags();

    if (user_io_laser_active_)
    {
      int8_t length = laser.update(&usart3, registers.system_time);
      if (length > 0)
      {
        udp_send_packet((unsigned char *) &laser.packet, sizeof(laser.packet), usart3_port);
      }
      else if (length < 0)
      {
        laser.reset(&usart3);
      }
    }
    else if (user_io_usart3_active_ && registers.usart3_char != 255)
    {
      while (1)
      {
        // Attempt to read from usart3 and forward packet
        int32_t c = usart3.read();

        if (c >= 0)
          usart3_string[usart3_len + 5] = c;
        else
          break;

        usart3_len++;

        if (c == registers.usart3_char)
        {
          // Send return string
          usart3_string[0] = 0xff;
          usart3_string[1] = 0xff;
          usart3_string[2] = 253;  // id
          usart3_string[3] = usart3_len + 2;  // len
          usart3_string[4] = DEVICE_USART3_DATA;  // we transmit address instead of error
          uint8_t checksum = 0;
          for (int i = 2; i < usart3_len + 5; i++)
            checksum += usart3_string[i];
          usart3_string[5+usart3_len] = 255 - checksum;
          udp_send_packet(usart3_string, usart3_len + 6, usart3_port);
          usart3_len = 0;
        }
        else if (usart3_len > 192)
        {
          // going to overflow, reset
          usart3_len = 0;
        }
      }
    }
  }
}

extern "C"
{

void SysTick_Handler(void)
{
  system_state.time = ++registers.system_time;

  if (tablebot_mode)
  {
    // Get system voltage:
    //   adc is 12 bit (4096 count) spread over 3.3V
    //   voltage divider is 15k/1k
    system_state.voltage = (adc1.get_channel1() / 4096.0f) * 3.3f * 16;

    // Get system/servo currents:
    //   ACS711: vcc/2 = 0A, 55mV/A
    system_state.current = ((adc1.get_channel3() - 2048.0f) / 4096.0f) * 3.3f / 0.055f;
    system_state.servo_current = ((adc1.get_channel2() - 2048.0f) / 4096.0f) * 3.3f / 0.055f;

    // Analog channels
    system_state.cliff_left = adc1.get_channel4();
    system_state.cliff_center = adc2.get_channel3();
    system_state.cliff_right = adc2.get_channel4();

    // Update motors
    if (registers.system_time % registers.motor_period == 0)
    {
      // Update table with position/velocity
      system_state.motor1_pos = m1_enc.read();
      system_state.motor2_pos = m2_enc.read();
      system_state.motor1_vel = m1_enc.read_speed();
      system_state.motor2_vel = m2_enc.read_speed();

      if (system_state.time - system_state.last_motor_command < 100 &&
          system_state.last_motor_command > 100)  // Avoid lurch on restart
      {
        m1.set(m1_pid.update_pid(system_state.motor1_vel));
        m2.set(m2_pid.update_pid(system_state.motor2_vel));
      }
      else
      {
        // Motors have timed out
        m1.disable();
        m2.disable();
        m1_pid.reset();
        m2_pid.reset();
      }

      // Compute odometry position
      float left_vel = system_state.motor1_vel / TICK_PER_METER;
      float right_vel = system_state.motor2_vel / TICK_PER_METER;
      float d = (left_vel + right_vel) / 2.0f;
      float dth = (right_vel - left_vel) / TRACK_WIDTH;
      if (d != 0)
      {
        float cos_th, sin_th;
        arm_sin_cos_f32(system_state.pose_th * 57.2958f, &sin_th, &cos_th);
        system_state.pose_x += cos_th * d;
        system_state.pose_y += sin_th * d;
      }
      system_state.pose_th = angle_wrap(system_state.pose_th + dth);
    }

    // Control LED
    if (system_state.run_state == MODE_UNSELECTED)
    {
      // Red LED indicates next selection (if any)
      int next_mode = get_next_mode();
      if (next_mode > 0)
      {
        // Blink out pattern
        if (system_state.time % 200 == 0)
        {
          if (system_state.time % 1000 < next_mode * 200)
          {
            error::high();
          }
        }
        else if (system_state.time % 100 == 0)
        {
          error::low();
        }
      }
      else
      {
        // Solid RED led
        error::high();
      }
    }
    else if (system_state.run_state == MODE_DONE)
    {
      // Toggle RED
      if (system_state.time % 200 == 0)
      {
        error::high();
      }
      else if (system_state.time % 100 == 0)
      {
        error::low();
      }

      // Blue OFF
      act::low();
    }
    else
    {
      // Red LED Off
      error::low();
      // Toggle Blue LED
      if (system_state.time % 200 == 0)
        act::high();
      else if (system_state.time % 100 == 0)
        act::low();
    }

    // Start next conversion of voltage/current
    adc1.convert();
    adc2.convert();
    return;
  }

  // Get system voltage in 0.1V increment:
  //   adc is 12 bit (4096 count) spread over 3.3V
  //   voltage divider is 15k/1k
  registers.system_voltage = (adc1.get_channel1()/4096.0f) * 3.3f * 16 * 10;

  // Get aux/servo currents in mA:
  //   ACS711: vcc/2 = 0A, 55mV/A
  registers.servo_current = ((adc1.get_channel2()-2048.0f)/4096.0f) * 3.3f / 0.055f * 1000;
  registers.aux_current = ((adc1.get_channel3()-2048.0f)/4096.0f) * 3.3f / 0.055f * 1000;

  // Analog channels
  registers.a0 = (registers.digital_dir & (1<<0)) ? 0 : adc1.get_channel4();
  registers.a1 = (registers.digital_dir & (1<<1)) ? 0 : adc2.get_channel3();
  registers.a2 = (registers.digital_dir & (1<<2)) ? 0 : adc2.get_channel4();
  
  // Update motors
  if (registers.system_time % registers.motor_period == 0)
  {
    // Update table with position/velocity
    registers.motor1_pos = m1_enc.read();
    registers.motor2_pos = m2_enc.read();
    registers.motor1_vel = m1_enc.read_speed();
    registers.motor2_vel = m2_enc.read_speed();

    if (registers.system_time - last_motor_cmd < 250)
    {
      // Update PID and set motor commands
      m1.set(m1_pid.update_pid(registers.motor1_vel));
      m2.set(m2_pid.update_pid(registers.motor2_vel));

      m1_trace.update(registers.motor1_pos,
                      registers.motor1_vel,
                      m1_pid.get_setpoint(),
                      m1.get());
      m2_trace.update(registers.motor2_pos,
                      registers.motor2_vel,
                      m2_pid.get_setpoint(),
                      m2.get());
    }
    else
    {
      // Motor commands have timed out
      m1.set(0);
      m2.set(0);
      m1_pid.reset();
      m2_pid.reset();
    }
  }

  // Update laser, if active
  if (user_io_laser_active_)
  {
    registers.tim12_mode = laser.get_control_pwm();
  }

  // Toggle LED
  if (registers.system_time - last_packet < 500)
  {
    if (registers.system_time % 200 == 0)
      act::high();
    else if (registers.system_time % 100 == 0)
      act::low();
  }
  else
  {
    act::low();
  }

  // Start next conversion of voltage/current
  adc1.convert();
  adc2.convert();
}

// Turn around the rs-485 bus
void USART1_IRQHandler(void)
{
  usart1.usartIrqHandler();
}

// Turn around the ax/mx bus
void USART2_IRQHandler(void)
{
  usart2.usartIrqHandler();
}

}
